# -*-coding:utf8-*-
"""
=========================================
author: xcq
time: 2024/6/19
email: kinson.xie@cathaypacific.com
=========================================
"""


# 函数的作用，提高代码的复用性,降低代码的耦合性（代码与代码之间有紧密联系）
# 函数命名规范：字母 数字 下划线组成，不能以数字开头
# 建议：小写，见名之意，单词与单词间用下划线分开

# 函数定义
def print_menu():
    print("[1]: 添加图书")
    print("[2]: 修改图书")
    print("[3]: 删除图书")
    print("[4]: 查询图书")
    print("[5]: 显示所有图书")
    print("[6]: 退出系统")

# 函数调用
# print_menu()
# print("====================")
# print_menu()


# 函数参数定义, 返回值（终止函数）
def add(a, b, c):
    return a + b + c

print(add(1, 2,3))
