# -*-coding:utf8-*-
"""
=========================================
author: xcq
time: 2024/5/9
email: kinson.xie@cathaypacific.com
=========================================
"""

"""
1. 第三方库安装
requests，openpyxl，pandas，pymysql，ddt

2. 请说出变量的命名规则，变量有什么作用
字母，数字，下划线组成，可以同时包含英文，数字以及下划线，但是不能以数字开头，不能和关键字同名（否则关键字的作用将会被覆盖）
它的作用是
    存储数据：变量可以把程序中准备使用的每一段数据都赋给一个简短、
            易于记忆的名字，用于保存程序运行时用户输入的数据、
            特定运算的结果以及要在窗体上显示的一段数据等。
            变量是一种使用方便的占位符，用于引用计算机内存地址，以便存储程序运行时可以更改的信息。
    传递和比较数据：变量也可以在程序中传递数据和进行比较。
    简练代码，使用变量可以避免在代码中直接使用复杂的数据结构或值，从而使代码更加简洁、易读。
    提高模块化：同时，通过将相关的数据和操作封装在变量中，可以提高代码的模块化程度，使代码更加易于维护和扩展。

3.python中注释的作用是什么？注释有几种写法
    提高代码可读性。通过为代码添加背景信息、目的和功能的解释，注释帮助其他开发者或未来的开发者更容易理解代码。
    记录决策。注释可以记录代码开发过程中的决策和选择，有助于回顾和参考。
    避免误解。通过提醒开发者注意修改的区域或解释特殊情况，注释有助于避免对代码的误解和歧义。
    提高维护性。良好的注释使代码更易于维护和更新，特别是在团队协作中。
    辅助调试。注释可以提供有关代码功能和行为的额外信息，对于调试和理解代码中的错误非常有帮助。
    文档生成。一些编程语言和工具可以利用注释来自动生成代码文档，这对于维护和更新软件非常有帮助。
    提示作用。在修改代码时，注释可以提醒开发者注意修改的区域。
    提高开发效率。注释可以帮助开发人员快速理解代码的结构和逻辑，提高开发效率。
    代码复习。在编写代码后，添加注释可以帮助自己回忆起代码的逻辑和实现方式，便于后续的维护和修改。

4.python的基本数据类型有哪些？如何查看数据类型（type）
    Python3 中常见的数据类型有：
    Number（数字）
    String（字符串）
    List（列表）
    Tuple（元组）
    Set（集合）
    Dictionary（字典）
    Python3 的六个标准数据类型中：
    
    不可变数据（3 个）：Number（数字）、String（字符串）、Tuple（元组）；
    可变数据（3 个）：List（列表）、Dictionary（字典）、Set（集合）。
    此外还有一些高级的数据类型，如: 字节数组类型(bytes)。
    
5.总结，思维导图

"""