# -*-coding:utf8-*-
"""
=========================================
author: xcq
time: 2024/6/19
email: kinson.xie@cathaypacific.com
=========================================
"""
# 1. 函数有哪几种参数类型，分别有什么特点
# 2、函数调用时，位置参数和关键字参数的顺序
# 3、编写函数，判断用户传入的对象（字符串、列表、元祖）长度是否大于5
# 4、编写函数，检查传入列表的长度，如果大于2，那么仅仅保留前两个长度的内容，并将新内容返回
# 5、定义一个函数，传入一个字典和字符串，判断字符串是否为字典中的值，如果字符串不在字典中，则添加到字典中，并返回新的字典
# 6、通过定义一个计算器函数，然后提示选择【1】加 【2】减 【3】乘 【4】除操作，选择之后返回对应操作的值
# 7、一个足球队在寻找年龄在15-22的妹子啦啦队（包含15,22）加入，编写一个程序，询问用户的性别和年龄，然后显示一条消息指出这个人是否可以加入球队，询问10次后，输出满足条件的总人数
# 8、将上次作业的图书管理系统改成函数版本，每个功能封装成一个函数，原来的功能上扩展，启动程序首先提示功能选项
# 【1】登录 【2】注册，完成注册功能
# main() 控制整个程序的运行流程
# print_menu() login() register() add_book() del_book() all_book() find_book()